## 📋 Terraform Plan

**Status:** ✅ Success

<details><summary>Show Plan Output</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.data_bucket will be created
  + resource "aws_s3_bucket" "data_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "terraform-demo-data-bucket"
          + "contact"     = "Platform Team: platform@example.com"
          + "department"  = "platform"
          + "domain"      = "infrastructure"
          + "environment" = "staging"
          + "production"  = "false"
          + "service"     = "terraform-demo"
        }
      + tags_all                    = {
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-demo-data-bucket"
          + "Project"     = "terraform-demo"
          + "Repository"  = "terraform-demo"
          + "contact"     = "Platform Team: platform@example.com"
          + "department"  = "platform"
          + "domain"      = "infrastructure"
          + "environment" = "staging"
          + "production"  = "false"
          + "service"     = "terraform-demo"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.logs_bucket will be created
  + resource "aws_s3_bucket" "logs_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "terraform-demo-logs-bucket"
          + "contact"     = "Platform Team: platform@example.com"
          + "department"  = "platform"
          + "domain"      = "infrastructure"
          + "environment" = "staging"
          + "production"  = "false"
          + "service"     = "terraform-demo"
        }
      + tags_all                    = {
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-demo-logs-bucket"
          + "Project"     = "terraform-demo"
          + "Repository"  = "terraform-demo"
          + "contact"     = "Platform Team: platform@example.com"
          + "department"  = "platform"
          + "domain"      = "infrastructure"
          + "environment" = "staging"
          + "production"  = "false"
          + "service"     = "terraform-demo"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_public_access_block.data_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "data_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.logs_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "logs_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.data_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "data_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.logs_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "logs_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.data_bucket will be created
  + resource "aws_s3_bucket_versioning" "data_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_versioning.logs_bucket will be created
  + resource "aws_s3_bucket_versioning" "logs_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + data_bucket_arn  = (known after apply)
  + data_bucket_name = (known after apply)
  + logs_bucket_arn  = (known after apply)
  + logs_bucket_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
</details>